Revit 2027 API
FabricationPart.Vendor Property
 The vendor of the fabrication part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string Vendor { get; }
Public ReadOnly Property Vendor As String
	Get
public:
property String^ Vendor {
	String^ get ();
}
member Vendor : string with get
Property Value
String
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace